"""
Name: Wiraya homdach
ID: 364411760008
Group: MIT421
"""

"""
วิธีรับประทานยาพาราเซตามอล
อายุ 10-15 ทานครั้งละ 1 เม็ด 10 <= age <= 15
อายุ 16-20 ทานครั้งละ 1.5 เม็ด
อายุ 20ปีขึ้นไป ทานครั้งละ 2 เม็ด
"""
# if-else-if

age = 20
# ถ้าอายุน้อยกว่า 20 คือ เด็ก ถ้ามากกว่า หรือเท่ากับ 20 คือผู้ใหญ่
print("ระบบเเนะนำการรับประทานยาพาราเซตามอล\n")
age = float(input("คุณอายุเท่าไร? : "))

if age <10:
    print("ไม่ควรรับประทาน.")
if age >=10 and age <= 15:
    print("รับประทานครั้งละ 1 เม็ด.")
elif age >= 16 and age <= 20:
        print("รับประทานครั้งละ 1.5 เม็ด.")
else:
    print("รับประทานครั้งละ 2 เม็ด.")
print("ขอบคุณครับ/คะ")